---
kind: method
id: M:Autodesk.Revit.DB.DocumentSet.Insert(Autodesk.Revit.DB.Document)
source: html/cbcf48ed-0b76-25b8-247b-ad53dae26abb.htm
---
# Autodesk.Revit.DB.DocumentSet.Insert Method

Insert the specified item into the set.

## Syntax (C#)
```csharp
public virtual bool Insert(
	Document item
)
```

## Parameters
- **item** (`Autodesk.Revit.DB.Document`) - The item to be inserted into the set.

## Returns
Returns whether the item was inserted into the set.